## Plan Result (1112: sbox_aria - Terraform Plan Apply)




<pre><code>Plan: 14 to add, 18 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_eventhub.aria_active_topic[&#34;00-pub&#34;]
  * azurerm_eventhub.aria_active_topic[&#34;00-res&#34;]
  * azurerm_eventhub.aria_active_topic[&#34;01-pub&#34;]
  * azurerm_eventhub.aria_active_topic[&#34;01-res&#34;]
  * azurerm_eventhub_authorization_rule.aria_active_topic_sas[&#34;00-pub&#34;]
  * azurerm_eventhub_authorization_rule.aria_active_topic_sas[&#34;00-res&#34;]
  * azurerm_eventhub_authorization_rule.aria_active_topic_sas[&#34;01-pub&#34;]
  * azurerm_eventhub_authorization_rule.aria_active_topic_sas[&#34;01-res&#34;]
  * azurerm_key_vault_secret.eventhub_active_topic_secrets[&#34;00-pub&#34;]
  * azurerm_key_vault_secret.eventhub_active_topic_secrets[&#34;00-res&#34;]
  * azurerm_key_vault_secret.eventhub_active_topic_secrets[&#34;01-pub&#34;]
  * azurerm_key_vault_secret.eventhub_active_topic_secrets[&#34;01-res&#34;]
  * local_file.config[&#34;00&#34;]
  * local_file.config[&#34;01&#34;]
* Update
  * azurerm_linux_function_app.example[&#34;00-af-active-ccd&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-aplfpa&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-aplfta&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-apluta&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-bails&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-joh&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-sbails&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-td&#34;]
  * azurerm_linux_function_app.example[&#34;01-af-active-ccd&#34;]
  * azurerm_linux_function_app.example[&#34;01-af-aplfpa&#34;]
  * azurerm_linux_function_app.example[&#34;01-af-aplfta&#34;]
  * azurerm_linux_function_app.example[&#34;01-af-apluta&#34;]
  * azurerm_linux_function_app.example[&#34;01-af-bails&#34;]
  * azurerm_linux_function_app.example[&#34;01-af-joh&#34;]
  * azurerm_linux_function_app.example[&#34;01-af-sbails&#34;]
  * azurerm_linux_function_app.example[&#34;01-af-td&#34;]
  * azurerm_storage_account.xcutting[&#34;00&#34;]
  * azurerm_storage_account.xcutting[&#34;01&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # data.azurerm_storage_account_sas.xcutting["00"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_storage_account_sas" "xcutting" {
      + connection_string = (sensitive value)
      + expiry            = "2027-12-31T23:59:59Z"
      + https_only        = true
      + id                = (known after apply)
      + sas               = (sensitive value)
      + start             = "2024-01-01T00:00:00Z"

      + permissions {
          + add     = true
          + create  = true
          + delete  = true
          + filter  = false
          + list    = true
          + process = true
          + read    = true
          + tag     = true
          + update  = true
          + write   = true
        }

      + resource_types {
          + container = true
          + object    = true
          + service   = true
        }

      + services {
          + blob  = true
          + file  = true
          + queue = true
          + table = true
        }
    }

  # data.azurerm_storage_account_sas.xcutting["01"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_storage_account_sas" "xcutting" {
      + connection_string = (sensitive value)
      + expiry            = "2027-12-31T23:59:59Z"
      + https_only        = true
      + id                = (known after apply)
      + sas               = (sensitive value)
      + start             = "2024-01-01T00:00:00Z"

      + permissions {
          + add     = true
          + create  = true
          + delete  = true
          + filter  = false
          + list    = true
          + process = true
          + read    = true
          + tag     = true
          + update  = true
          + write   = true
        }

      + resource_types {
          + container = true
          + object    = true
          + service   = true
        }

      + services {
          + blob  = true
          + file  = true
          + queue = true
          + table = true
        }
    }

  # azurerm_eventhub.aria_active_topic["00-pub"] will be created
  + resource "azurerm_eventhub" "aria_active_topic" {
      + id                  = (known after apply)
      + message_retention   = 7
      + name                = "evh-active-pub-sbox-00-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "ingest00-integration-eventHubNamespace001-sbox"
      + partition_count     = 8
      + partition_ids       = (known after apply)
      + resource_group_name = "ingest00-main-sbox"
      + status              = "Active"
    }

  # azurerm_eventhub.aria_active_topic["00-res"] will be created
  + resource "azurerm_eventhub" "aria_active_topic" {
      + id                  = (known after apply)
      + message_retention   = 7
      + name                = "evh-active-res-sbox-00-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "ingest00-integration-eventHubNamespace001-sbox"
      + partition_count     = 8
      + partition_ids       = (known after apply)
      + resource_group_name = "ingest00-main-sbox"
      + status              = "Active"
    }

  # azurerm_eventhub.aria_active_topic["01-pub"] will be created
  + resource "azurerm_eventhub" "aria_active_topic" {
      + id                  = (known after apply)
      + message_retention   = 7
      + name                = "evh-active-pub-sbox-01-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "ingest01-integration-eventHubNamespace001-sbox"
      + partition_count     = 8
      + partition_ids       = (known after apply)
      + resource_group_name = "ingest01-main-sbox"
      + status              = "Active"
    }

  # azurerm_eventhub.aria_active_topic["01-res"] will be created
  + resource "azurerm_eventhub" "aria_active_topic" {
      + id                  = (known after apply)
      + message_retention   = 7
      + name                = "evh-active-res-sbox-01-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "ingest01-integration-eventHubNamespace001-sbox"
      + partition_count     = 8
      + partition_ids       = (known after apply)
      + resource_group_name = "ingest01-main-sbox"
      + status              = "Active"
    }

  # azurerm_eventhub_authorization_rule.aria_active_topic_sas["00-pub"] will be created
  + resource "azurerm_eventhub_authorization_rule" "aria_active_topic_sas" {
      + eventhub_name                     = "evh-active-pub-sbox-00-uks-dlrm-01"
      + id                                = (known after apply)
      + listen                            = true
      + manage                            = true
      + name                              = "aria_manage_sas"
      + namespace_name                    = "ingest00-integration-eventHubNamespace001-sbox"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + resource_group_name               = "ingest00-main-sbox"
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = true
    }

  # azurerm_eventhub_authorization_rule.aria_active_topic_sas["00-res"] will be created
  + resource "azurerm_eventhub_authorization_rule" "aria_active_topic_sas" {
      + eventhub_name                     = "evh-active-res-sbox-00-uks-dlrm-01"
      + id                                = (known after apply)
      + listen                            = true
      + manage                            = true
      + name                              = "aria_manage_sas"
      + namespace_name                    = "ingest00-integration-eventHubNamespace001-sbox"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + resource_group_name               = "ingest00-main-sbox"
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = true
    }

  # azurerm_eventhub_authorization_rule.aria_active_topic_sas["01-pub"] will be created
  + resource "azurerm_eventhub_authorization_rule" "aria_active_topic_sas" {
      + eventhub_name                     = "evh-active-pub-sbox-01-uks-dlrm-01"
      + id                                = (known after apply)
      + listen                            = true
      + manage                            = true
      + name                              = "aria_manage_sas"
      + namespace_name                    = "ingest01-integration-eventHubNamespace001-sbox"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + resource_group_name               = "ingest01-main-sbox"
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = true
    }

  # azurerm_eventhub_authorization_rule.aria_active_topic_sas["01-res"] will be created
  + resource "azurerm_eventhub_authorization_rule" "aria_active_topic_sas" {
      + eventhub_name                     = "evh-active-res-sbox-01-uks-dlrm-01"
      + id                                = (known after apply)
      + listen                            = true
      + manage                            = true
      + name                              = "aria_manage_sas"
      + namespace_name                    = "ingest01-integration-eventHubNamespace001-sbox"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + resource_group_name               = "ingest01-main-sbox"
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = true
    }

  # azurerm_key_vault_secret.eventhub_active_topic_secrets["00-pub"] will be created
  + resource "azurerm_key_vault_secret" "eventhub_active_topic_secrets" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.KeyVault/vaults/ingest00-meta002-sbox"
      + name                    = "evh-active-pub-sbox-00-uks-dlrm-01-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"  = "dlrm-data-ingest"
          + "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
        }
      + value                   = (sensitive value)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.eventhub_active_topic_secrets["00-res"] will be created
  + resource "azurerm_key_vault_secret" "eventhub_active_topic_secrets" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.KeyVault/vaults/ingest00-meta002-sbox"
      + name                    = "evh-active-res-sbox-00-uks-dlrm-01-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"  = "dlrm-data-ingest"
          + "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
        }
      + value                   = (sensitive value)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.eventhub_active_topic_secrets["01-pub"] will be created
  + resource "azurerm_key_vault_secret" "eventhub_active_topic_secrets" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-main-sbox/providers/Microsoft.KeyVault/vaults/ingest01-meta002-sbox"
      + name                    = "evh-active-pub-sbox-01-uks-dlrm-01-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"  = "dlrm-data-ingest"
          + "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
        }
      + value                   = (sensitive value)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.eventhub_active_topic_secrets["01-res"] will be created
  + resource "azurerm_key_vault_secret" "eventhub_active_topic_secrets" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-main-sbox/providers/Microsoft.KeyVault/vaults/ingest01-meta002-sbox"
      + name                    = "evh-active-res-sbox-01-uks-dlrm-01-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"  = "dlrm-data-ingest"
          + "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
        }
      + value                   = (sensitive value)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_linux_function_app.example["00-af-active-ccd"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          + "AzureWebJobsStorage"                                   = (sensitive value)
          + "FUNCTIONS_EXTENSION_VERSION"                           = "~4"
            # (9 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Web/sites/af-active-ccd-sbox00-uks-dlrm-01"
        name                                           = "af-active-ccd-sbox00-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["00-af-aplfpa"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          + "AzureWebJobsStorage"                                   = (sensitive value)
          + "FUNCTIONS_EXTENSION_VERSION"                           = "~4"
            # (9 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Web/sites/af-aplfpa-sbox00-uks-dlrm-01"
        name                                           = "af-aplfpa-sbox00-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["00-af-aplfta"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          + "AzureWebJobsStorage"                                   = (sensitive value)
          + "FUNCTIONS_EXTENSION_VERSION"                           = "~4"
            # (9 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Web/sites/af-aplfta-sbox00-uks-dlrm-01"
        name                                           = "af-aplfta-sbox00-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["00-af-apluta"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          + "AzureWebJobsStorage"                                   = (sensitive value)
          + "FUNCTIONS_EXTENSION_VERSION"                           = "~4"
            # (9 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Web/sites/af-apluta-sbox00-uks-dlrm-01"
        name                                           = "af-apluta-sbox00-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["00-af-bails"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          + "AzureWebJobsStorage"                                   = (sensitive value)
          + "FUNCTIONS_EXTENSION_VERSION"                           = "~4"
            # (9 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Web/sites/af-bails-sbox00-uks-dlrm-01"
        name                                           = "af-bails-sbox00-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["00-af-joh"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          + "AzureWebJobsStorage"                                   = (sensitive value)
          + "FUNCTIONS_EXTENSION_VERSION"                           = "~4"
            # (9 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Web/sites/af-joh-sbox00-uks-dlrm-01"
        name                                           = "af-joh-sbox00-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["00-af-sbails"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          + "AzureWebJobsStorage"                                   = (sensitive value)
          + "FUNCTIONS_EXTENSION_VERSION"                           = "~4"
            # (9 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Web/sites/af-sbails-sbox00-uks-dlrm-01"
        name                                           = "af-sbails-sbox00-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["00-af-td"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          + "AzureWebJobsStorage"                                   = (sensitive value)
          + "FUNCTIONS_EXTENSION_VERSION"                           = "~4"
            # (9 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Web/sites/af-td-sbox00-uks-dlrm-01"
        name                                           = "af-td-sbox00-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["01-af-active-ccd"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          + "AzureWebJobsStorage"                                   = (sensitive value)
          + "FUNCTIONS_EXTENSION_VERSION"                           = "~4"
            # (9 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-main-sbox/providers/Microsoft.Web/sites/af-active-ccd-sbox01-uks-dlrm-01"
        name                                           = "af-active-ccd-sbox01-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["01-af-aplfpa"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          + "AzureWebJobsStorage"                                   = (sensitive value)
          + "FUNCTIONS_EXTENSION_VERSION"                           = "~4"
            # (9 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-main-sbox/providers/Microsoft.Web/sites/af-aplfpa-sbox01-uks-dlrm-01"
        name                                           = "af-aplfpa-sbox01-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["01-af-aplfta"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          + "AzureWebJobsStorage"                                   = (sensitive value)
          + "FUNCTIONS_EXTENSION_VERSION"                           = "~4"
            # (9 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-main-sbox/providers/Microsoft.Web/sites/af-aplfta-sbox01-uks-dlrm-01"
        name                                           = "af-aplfta-sbox01-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["01-af-apluta"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          + "AzureWebJobsStorage"                                   = (sensitive value)
          + "FUNCTIONS_EXTENSION_VERSION"                           = "~4"
            # (9 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-main-sbox/providers/Microsoft.Web/sites/af-apluta-sbox01-uks-dlrm-01"
        name                                           = "af-apluta-sbox01-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["01-af-bails"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          + "AzureWebJobsStorage"                                   = (sensitive value)
          + "FUNCTIONS_EXTENSION_VERSION"                           = "~4"
            # (9 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-main-sbox/providers/Microsoft.Web/sites/af-bails-sbox01-uks-dlrm-01"
        name                                           = "af-bails-sbox01-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["01-af-joh"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          + "AzureWebJobsStorage"                                   = (sensitive value)
          + "FUNCTIONS_EXTENSION_VERSION"                           = "~4"
            # (9 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-main-sbox/providers/Microsoft.Web/sites/af-joh-sbox01-uks-dlrm-01"
        name                                           = "af-joh-sbox01-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["01-af-sbails"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          + "AzureWebJobsStorage"                                   = (sensitive value)
          + "FUNCTIONS_EXTENSION_VERSION"                           = "~4"
            # (9 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-main-sbox/providers/Microsoft.Web/sites/af-sbails-sbox01-uks-dlrm-01"
        name                                           = "af-sbails-sbox01-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["01-af-td"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          + "AzureWebJobsStorage"                                   = (sensitive value)
          + "FUNCTIONS_EXTENSION_VERSION"                           = "~4"
            # (9 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-main-sbox/providers/Microsoft.Web/sites/af-td-sbox01-uks-dlrm-01"
        name                                           = "af-td-sbox01-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_storage_account.xcutting["00"] will be updated in-place
  ~ resource "azurerm_storage_account" "xcutting" {
        id                                 = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Storage/storageAccounts/ingest00xcuttingsbox"
        name                               = "ingest00xcuttingsbox"
      ~ tags                               = {
          - "application"  = "dlrm-data-ingest" -> null
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra" -> null
          - "businessArea" = "cross-cutting" -> null
          - "environment"  = "sandbox" -> null
        }
        # (96 unchanged attributes hidden)

      + network_rules {
          + bypass         = (known after apply)
          + default_action = "Allow"
          + ip_rules       = (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # azurerm_storage_account.xcutting["01"] will be updated in-place
  ~ resource "azurerm_storage_account" "xcutting" {
        id                                 = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-main-sbox/providers/Microsoft.Storage/storageAccounts/ingest01xcuttingsbox"
        name                               = "ingest01xcuttingsbox"
      ~ tags                               = {
          - "application"  = "dlrm-data-ingest" -> null
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra" -> null
          - "businessArea" = "cross-cutting" -> null
          - "environment"  = "sandbox" -> null
        }
        # (96 unchanged attributes hidden)

      + network_rules {
          + bypass         = (known after apply)
          + default_action = "Allow"
          + ip_rules       = (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # local_file.config["00"] will be created
  + resource "local_file" "config" {
      + content              = jsonencode(
            {
              + env = "sbox"
              + lz  = "00"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./tmp/config_sbox_00.json"
      + id                   = (known after apply)
    }

  # local_file.config["01"] will be created
  + resource "local_file" "config" {
      + content              = jsonencode(
            {
              + env = "sbox"
              + lz  = "01"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./tmp/config_sbox_01.json"
      + id                   = (known after apply)
    }

Plan: 14 to add, 18 to change, 0 to destroy.
```

</details>





## :warning: Errors

* failed to add a label 1112: sbox_aria - Terraform Plan Apply/add-or-update: label name is too long (max: 50)
<!-- github-comment: {"Command":"plan","PRNumber":201,"Program":"tfcmt","SHA1":"","Target":"1112: sbox_aria - Terraform Plan Apply","Vars":{}} -->